{"document": {"@ids": "estimation", "@names": "estimation", "@source": "<string>", "@title": "Estimation", "title": "Estimation", "comment": [{"@xml:space": "preserve", "#text": "This file is part of the OpenDSA eTextbook project. See"}, {"@xml:space": "preserve", "#text": "http://algoviz.org/OpenDSA for more details."}, {"@xml:space": "preserve", "#text": "Copyright (c) 2012-2016 by the OpenDSA Project Contributors, and"}, {"@xml:space": "preserve", "#text": "distributed under an MIT open source license."}], "raw": [{"@format": "xml", "@xml:space": "preserve", "avmetadata": "null"}, {"@format": "xml", "@xml:space": "preserve", "index": "null"}], "paragraph": [{"title_reference": "Estimation", "#text": "One of the most useful life skills that you can gain from your\ncomputer science training is the ability to perform quick estimates.\nThis is sometimes known as \"back of the napkin\" or\n\"back of the envelope\" calculation.\nBoth nicknames suggest that only a rough estimate is produced.\n techniques are a standard part of engineering\ncurricula but are often neglected in computer science.\nEstimation is no substitute for rigorous, detailed analysis\nof a problem, but it can help to decide when a rigorous\nanalysis is warranted:\nIf the initial estimate indicates that the solution\nis unworkable, then further analysis is probably unnecessary."}, "Estimation can be formalized by the following three-step process:", "When doing estimations, a good way to reassure yourself that the\nestimate is reasonable is to do it in two different ways.\nIn general, if you want to know what comes out of a system, you can\neither try to estimate that directly, or you can estimate what goes\ninto the system (assuming that what goes in must later come out).\nIf both approaches (independently) give similar answers, then this\nshould build confidence in the estimate.", "When calculating, be sure that your units match.\nFor example, do not add feet and pounds.\nVerify that the result is in the correct units.\nAlways keep in mind that the output of a calculation is only\nas good as its input.\nThe more uncertain your valuation for the input parameters in Step 3,\nthe more uncertain the output value.\nHowever, back of the envelope calculations are often meant only to get\nan answer within an order of magnitude, or perhaps within a factor of\ntwo.\nBefore doing an estimate, you should decide on acceptable error\nbounds, such as within 25%, within a factor of two, and so forth.\nOnce you are confident that an estimate falls within your error\nbounds, leave it alone!\nDo not try to get a more precise estimate than necessary for your\npurpose."], "enumerated_list": {"@enumtype": "arabic", "@prefix": "", "@suffix": ".", "list_item": [{"paragraph": "Determine the major parameters that affect the problem."}, {"paragraph": "Derive an equation that relates the parameters to the problem."}, {"paragraph": "Select values for the parameters, and apply the equation to yield an\nestimated solution."}]}, "topic": [{"title": "Example", "paragraph": "How many library bookcases does it take to store books containing one\nmillion pages?\nI estimate that a 500-page book requires one inch on the\nlibrary shelf (it will help to look at the size of any handy book),\nyielding about 200 feet of shelf space for one million pages.\nIf a shelf is 4 feet wide, then 50 shelves are required.\nIf a bookcase contains 5 shelves, this yields about 10 library\nbookcases.\nTo reach this conclusion, I estimated the number of pages per\ninch, the width of a shelf, and the number of shelves in a\nbookcase.\nNone of my estimates are likely to be precise, but I feel confident\nthat my answer is correct to within a factor of two.\n(After writing this, I went to Virginia Tech's library and looked at\nsome real bookcases.\nThey were only about 3 feet wide, but typically had 7 shelves for a\ntotal of 21 shelf-feet.\nSo I was correct to within 10% on bookcase capacity, far better than\nI expected or needed.\nOne of my selected values was too high, and the other too low, which\ncanceled out the errors.)"}, {"title": "Example", "paragraph": "Is it more economical\nto buy a car that gets 20 miles per gallon, or one that gets 30 miles\nper gallon but costs \\$3000 more?\nThe typical car is driven about 12,000 miles per year.\nIf gasoline costs \\$3/gallon, then the yearly gas bill is\n\\$1800 for the less efficient car and \\$1200 for the more\nefficient car.\nIf we ignore issues such as the payback that would be received if we\ninvested \\$3000 in a bank, it would take 5 years to make up the\ndifference in price.\nAt this point, the buyer must decide if price is the only criterion and\nif a 5-year payback time is acceptable.\nNaturally, a person who drives more will make up the difference more\nquickly, and changes in gasoline prices will also greatly affect the\noutcome."}, {"title": "Example", "paragraph": "When at the supermarket doing the week's shopping, can you estimate\nabout how much you will have to pay at the checkout?\nOne simple way is to round the price of each item to the nearest\ndollar, and add this value to a mental running total as you put the\nitem in your shopping cart.\nThis will likely give an answer within a couple of dollars of the true\ntotal."}]}}