{"document": {"@ids": "chapter-introduction-file-processing", "@names": "chapter\\ introduction:\\ file\\ processing", "@source": "<string>", "@title": "Chapter Introduction: File Processing", "title": "Chapter Introduction: File Processing", "comment": [{"@xml:space": "preserve", "#text": "This file is part of the OpenDSA eTextbook project. See"}, {"@xml:space": "preserve", "#text": "http://algoviz.org/OpenDSA for more details."}, {"@xml:space": "preserve", "#text": "Copyright (c) 2012-2016 by the OpenDSA Project Contributors, and"}, {"@xml:space": "preserve", "#text": "distributed under an MIT open source license."}], "raw": {"@format": "xml", "@xml:space": "preserve", "avmetadata": "null"}, "paragraph": ["Earlier chapters presented basic data structures and algorithms\nthat operate on data stored in main memory.\nSome applications require that large amounts of information be stored\nand processed  so much information that it cannot all fit into main\nmemory.\nIn that case, the information must reside on disk and be brought into\nmain memory selectively for processing.", "You probably already realize that main memory access is much faster\nthan access to data stored on disk or other storage devices.\nThe relative difference in access times is so great that\nefficient disk-based programs require a different approach to\nalgorithm design than most programmers are used to.\nAs a result, many programmers do a poor job when it comes to file\nprocessing applications.", {"title_reference": ["buffer pool <buffer pool> <BuffPool>", "caching"], "#text": "This chapter presents the fundamental issues relating to the design of\nalgorithms and data structures for disk-based\napplications.\nWe begin with a description of the significant differences\nbetween primary memory and secondary storage,\nand then discuss the different types of  memory in\na computer and how they compare for price and performance.\nComputer technology changes rapidly.\nThis chapter provides examples of disk drive specifications and\nother hardware performance numbers that are reasonably up to\ndate as of the time when it was written.\nWhen you read it, the numbers might seem out of date.\nHowever, the basic principles do not change.\nThe approximate ratios for time, space, and cost between memory and\ndisk have remained surprisingly steady for over 30 years.\nThe most important concept in the chapter is the\n, which is the fundamental\nmechanism for implementing many  systems."}]}}