{"document": {"@ids": "an-introduction-to-problem-solving", "@names": "an\\ introduction\\ to\\ problem\\ solving", "@source": "<string>", "@title": "An Introduction to Problem Solving", "title": "An Introduction to Problem Solving", "comment": [{"@xml:space": "preserve", "#text": "This file is part of the OpenDSA eTextbook project. See"}, {"@xml:space": "preserve", "#text": "http://algoviz.org/OpenDSA for more details."}, {"@xml:space": "preserve", "#text": "Copyright (c) 2012-2016 by the OpenDSA Project Contributors, and"}, {"@xml:space": "preserve", "#text": "distributed under an MIT open source license."}], "raw": {"@format": "xml", "@xml:space": "preserve", "avmetadata": "null"}, "section": [{"@ids": "getting-started", "@names": "getting\\ started", "title": "Getting Started", "paragraph": ["This document presents a brief overview of selected material from four\ntextbooks (see [FL95, Lev94, WL99, Zei07] in the bibliography).\nReading any of these books should help you to become a better\nproblem solver.", "To successfully solve any problem, the most important issue to get\nactively involved.\nLevine [Lev94] calls this \"The Principle of Intimate Engagement\".\nWriters on problem solving often use terms like \"roll up your sleeves\"\nand \"get your hands dirty\".\nIt means actively engaging with the problem, and doing some work to\nget it done.\nFor easier problems, you will \"see\" an answer fairly quickly\nonce you actively engage, and the issue then is to work through to\ncompletion.\nFor most problems, the ones matter most, you won't \"see\" an answer\nright away.\nFor these problems, you will have to use various strategies to come up\nwith a potential solution for even getting started.", "Problem solvers can be categorized as either \"engagers\" or\n\"dismissers\".\nEngagers typically have a history of success with problem solving.\nDismissers have a history of failure.\nOf course, you might be an engager for one type of problem,\nand a dismisser for another.\nMany students do significant problem solving for recreation\nSodoku puzzles, computer games with meaningful problem solving tasks,\nand all sorts of \"puzzles\".\nThey might spend hours engaged with \"interesting\" problems.\nYet, these same students might dismiss math and analytical computer\nscience problems due to a historical lack of success.\nIf you have this problem, then to be successful in life you will\nneed to find ways to get over what is obviously a mental block.\nYou need to learn to transfer successful problem-solving strategies\nfrom one part of your life to other parts.", "Levine uses examples of trying to repair a clothes dryer or a wobbly\ntable.\nHow to solve the problem might not be immediately obvious.\nThe first step is to take the effort to look at the problem.\nIn this example, it starts by opening the back of the dryer, or\nlooking under the table.\nThis initial investigation can often lead to a solution.\nIt is a matter of adopting the mental attitude of being willing to\ntake the risk and the effort.\nThen it is a matter of working with the problem for awhile to see what\ncan be done. At that point, a possible solution path might open\nup.\nBut nothing can be solved unless you are willing to take the time and\nmake the effort.\nAll of the heuristics for solving problems start with that.", "Fogler and LeBlanc [FL95] discuss the differences between effective and\nineffective problem solvers."], "block_quote": {"paragraph": ["The most important factors that distinguish between ineffective and\neffective problem solvers are the attitudes with which they\napproach the problem, their aggressiveness in the problem-solving\nprocess, their concern for accuracy, and the solution procedures\nthey use.\nFor example, effective problem solvers believe that problems can be\nsolved through the use of heuristics and careful persistent\nanalysis, while ineffective problem solvers think, \"You either know\nit or you don't\".", "Effective problem solvers become very active in the problem-solving\nprocess:\nThey draw figures, make sketches, and ask questions of themselves\nand others.\nIneffective problem solvers don't seem to understand the level of\npersonal effort needed to solve the problem.\nEffective problem solvers take great care to understand all the\nfacts and relationships accurately.\nIneffective problem solvers make judgments without checking for\naccuracy...\nBy approaching a situation using the characteristic attitudes and\nactions of an effective problem solver, you will be well on your\nway to finding the real problem and generating an outstanding\nsolution."]}}, {"@ids": "investigation-and-argument", "@names": "investigation\\ and\\ argument", "title": "Investigation and Argument", "paragraph": "Problem solving has two parts [Zei07]: the investigation and the\nargument.\nStudents are too used to seeing only the argument in their textbooks\nand lectures.\nUnfortunately, to be successful in school (and in life after school),\none needs to be good at both, and to understand the differences\nbetween these two phases of the process.\nTo solve the problem, you must investigate successfully.\nThen, to give the answer to your client (solution on homework or exam,\nor report to boss), you need to be able to make the argument in a way\nthat gets the solution across clearly and succinctly.\nThe argument phase involves good technical writing skills  the\nability to make a clear, logical argument.\nUnderstanding standard proof techniques can help you.\nThe three most-used proof techniques are deduction (direct proof),\ncontradiction, and induction."}, {"@ids": "heuristics-for-problem-solving-in-the-small", "@names": "heuristics\\ for\\ problem\\ solving\\ \"in\\ the\\ small\"", "title": "Heuristics for Problem Solving \"In the Small\"", "paragraph": [{"strong": "Write it down", "title_reference": "7pm 2", "#text": "After motivation and mental attitude, the most important limitation on\nyour ability to solve problems is biological:\nWhile you have lots of storage capacity, your \"working memory\" is\ntiny.\nFor active manipulation, you can only store \npieces of information.\nYou can't change this biological fact.\nAll you can do is take advantage of your environment to get around it.\nThat means, you must put things into your environment to manipulate\nthem.\nMost often, that translates to writing things down, and doing it in a\nway that lets you manipulate aspects of the problem (correct\nrepresentation)."}, {"strong": "Look for special features", "#text": "Examples include cryptogram addition problems.\nYou might recognize that something on one end must be a 1,\nin other circumstances one of the numbers must be a zero.\nConsider the following cryptogram puzzle where you must replace the\nletters with numbers to make a legal addition problem.\nIn this case, we should recognize two special features:\n(1) The leading digit of the answer must be a one, and\n(2) One of the right most digits must be a zero.\nRecognizing these special features puts us well on the way to solving\nthe full problem."}, {"strong": "Go to the extremes", "#text": "Study boundary conditions of the problem.\nFor lots of problems, it helps to start with the small cases, which\nare one form of boundary condition."}, {"strong": "Simplify", "#text": "A version of going to extremes is to simplify the problem.\nThis might give a partial solution that can be extended to the\noriginal problem."}, {"strong": "Penultimate step", "#text": "What precondition must take place before the final solution step is\npossible?\nIf you recognize this, then getting to the penultimate step leads to\nthe final solution, and solving the penultimate problem might be\neasier.\nTowers of Hanoi gives an excellent example of finding a\nsolution from looking at the penultimate step."}, {"strong": "Lateral thinking", "#text": "Be careful about being lead into a blind alley.\nUsing an inappropriate problem-solving strategy might blind you to the\nsolution."}, {"strong": "Get your hands dirty", "#text": "Sometimes you need to just \"play around\" with the problem to get some\ninitial insight.\nFor example, when trying to see the closed form solution to a\nsummation, its often a good place to start writing the first few sums\ndown."}, {"strong": "Wishful thinking", "#text": "A version of simplifying the problem.\nSometimes you can transform the problem into something easy, or see\nhow to get the start position to something that you could \"wish\" was\nthe solution.\nThat might be a smaller step to the actual solution."}, {"strong": "Symmetry", "#text": "Look for symmetries in the problem.\nThey might give clues to the solution."}], "literal_block": {"@xml:space": "preserve", "#text": "A D\n+ D I\n-----\nD I D"}}, {"@ids": "problem-solving-in-the-large", "@names": "problem\\ solving\\ \"in\\ the\\ large\"", "title": "Problem Solving \"In the Large\"", "paragraph": ["There are lots of standard techniques for solving larger and messier\n\"real-world\" problems (the type of problems often encountered by\nengineers in their professional lives).\nFogler and LeBlanc [FL95] discuss such techniques in detail.\nHere is a brief outline of an overall process for disciplined problem\nsolving of \"real world\" problems.", {"strong": "Problem Definition", "#text": "The client for a problem will often not state it in the correct\nway.\nYour first step toward solution is often to define the \"real\" problem\nthat needs to be solved.\nIt might not be obvious what this is.\nTo get at the \"real\" problem, you will need to begin by studying it,\ncollecting information about it, and talking to people familiar with\nthe problem.\nYou might consider restating the problem in a number of ways.\nDefine the desired state.\nThen make restatements of the current problem formulation that can\ntrigger new insights.\nConsider looking at the problem statement by making the opposite\nstatement.\nAlternatively, perhaps we can change the surrounding situation such\nthat the current problem can be \"made OK\" rather than solved\ndirectly."}, {"strong": "Generate solutions", "#text": "Once you have settled on a problem statement, you need to generate and\nanalyze a range of possible solutions.\nBlockbusting and brainstorming techniques can generate a\nlist of possible solutions to study."}, {"strong": "Decide the Course of Action", "#text": "There are a number of standard techniques for select from a given\nlist of potential actions\n(e.g., situation analysis, Pareto analysis, K.T. Problem analysis,\ndecision analysis)."}, {"strong": "Implement the Solution", "#text": "Getting approval may be the necessary first step to implementation.\nOnce that is taken care of, again there are a number of standard\ntechniques for planning implementations\n(e.g., Gannt charts, critical path analysis)."}, {"strong": "Evaluation", "#text": "Evaluation should be built into all phases of the problem solving\nprocess."}]}, {"@ids": "pairs-problem-solving", "@names": "pairs\\ problem\\ solving", "title": "Pairs Problem Solving", "paragraph": "Whimbey & Lochhead [WL99] discuss a technique for pair problem solving\nthat separates the pair into a solver and a listener.\nThe listener plays an active role, being responsible for keeping the\nproblem solver on track and requiring the problem solver to vocalize\nhis or her process.\nThe listener is actively checking for errors by the problem solver.\nSee the handout for more details on this."}, {"@ids": "errors-in-reasoning", "@names": "errors\\ in\\ reasoning", "title": "Errors in Reasoning", "paragraph": ["Again from Whimbey & Lochhead [WL99] comes a description of how people\ngo wrong in problem solving.\nSpecifically related to homework and tests, typical problems stem from\nfailing to read the problem carefully.\nThus, students will often fail to use all relevant facts, or plain\nmis-interpret the problem.\nOther typical mistakes come from failing to be systematic, or worse\nyet being just plain careless.\nAll of this indicates that many of the points lost by students on\ntests and homeworks are not caused by \"not knowing the material\", but\nrather are caused by not executing problem solving effectively.\nThose are points that don't need to be lost.", "Comprehension in reading is a major factor to success.\nProper comprehension of technical material requires careful reading,\nand often re-reading.\nThere is no such thing as speed reading with comprehension.\nThe mythology of the speed reading advocates,\nsuch as \"read in thought groups\", \"skim for concepts\", and \"don't\nre-read\", are all ineffective."]}, {"@ids": "references", "@names": "references", "title": "References", "paragraph": ["[FL95] H. Scott Fogler and Steven E. LeBlanc.\nStrategies for Creative Problem Solving.\nPrentice Hall, 1995.", "[Lev94] Marvin Levine.\nEffective Problem Solving.\nPrentice Hall, second edition, 1994.", "[WL99] Arthur Whimbey and Jack Lochhead.\nProblem Solving & Comprehension.\nLawrence Erlbaum Associates, sixth edition, 1999.", "[Zei07] Paul Zeitz.\nThe Art and Craft of Problem Solving.\nJohn Wiley & Sons, second edition, 2007."]}]}}