{"document": {"@ids": "primary-versus-secondary-storage", "@names": "primary\\ versus\\ secondary\\ storage", "@source": "<string>", "@title": "Primary versus Secondary Storage", "title": "Primary versus Secondary Storage", "comment": [{"@xml:space": "preserve", "#text": "This file is part of the OpenDSA eTextbook project. See"}, {"@xml:space": "preserve", "#text": "http://algoviz.org/OpenDSA for more details."}, {"@xml:space": "preserve", "#text": "Copyright (c) 2012-2016 by the OpenDSA Project Contributors, and"}, {"@xml:space": "preserve", "#text": "distributed under an MIT open source license."}], "raw": {"@format": "xml", "@xml:space": "preserve", "avmetadata": "null"}, "paragraph": [{"title_reference": ["primary storage", "main memory", "secondary storage", "peripheral storage", "Random Access Memory"], "#text": "Computer storage devices are typically classified into\n or  on the one hand, and\n or  on the other.\nPrimary memory usually refers to  (RAM),\nwhile secondary storage refers to devices such as\nhard disk drives, solid state drives, removable \"USB\" drives,\nCDs, and DVDs.\nPrimary memory also includes registers, cache, and video memories,\nbut we will ignore them for this discussion because their existence\ndoes not affect the principal differences between primary and\nsecondary memory."}, {"title_reference": "#Price", "#text": "Along with a faster CPU, every new model of computer seems to come\nwith more main memory.\nAs memory size continues to increase, is it possible that\nrelatively slow disk storage will be unnecessary?\nProbably not, because the desire to store and process larger files\ngrows at least as fast as main memory size.\nPrices for both main memory and peripheral storage devices have\ndropped dramatically in recent years, as demonstrated by\nTable .\nHowever, the cost per unit of disk drive storage is about two\norders of magnitude less than RAM and has been for\nmany years."}, "There is now a wide range of removable media available for\ntransferring data or storing data offline in relative safety.\nThese include floppy disks (now largely obsolete), writable CDs and\nDVDs, \"flash\" drives, and magnetic tape.\nOptical storage such as CDs and DVDs costs roughly half the price of\nhard disk drive space per megabyte, and have become practical for use\nas backup storage within the past few years.\nTape used to be much cheaper than other media, and was the preferred\nmeans of backup, but are not so popular now as other media have\ndecreased in price.\nFlash drives cost the most per megabyte, but due to their storage\ncapacity and flexibility, quickly replaced floppy disks as the\nprimary storage device for transferring data between computer when\ndirect network transfer is not available.", {"title_reference": ["persistent", "volatile"], "#text": "Secondary storage devices have\nat least two other advantages over RAM memory.\nPerhaps most importantly, disk, flash, and optical media are\n,\nmeaning that they are not erased from the media when the power is\nturned off.\nIn contrast, RAM used for main memory is usually \nall information is lost with the power.\nA second advantage is that CDs and USB drives\ncan easily be transferred between computers.\nThis provides a convenient way to take information from one computer\nto another."}, {"title_reference": ["thousandths", "billionths"], "#text": "In exchange for reduced storage costs, persistence, and\nportability, secondary storage devices pay a penalty in terms of\nincreased access time.\nWhile not all accesses to disk take the same amount of time\n(more on this later), the typical time required to access a byte of\nstorage from a disk drive in 2011 is around 9 ms\n(i.e., 9  of a second).\nThis might not seem slow, but compared to the time required\nto access a byte from main memory, this is fantastically slow.\nTypical access time from standard personal computer RAM in\n2011 is about 5-10 nanoseconds\n(i.e., 5-10  of a second).\nThus, the time to access a byte of data from a disk drive is about\nsix orders of magnitude greater than that required to\naccess a byte from main memory.\nWhile disk drive and RAM access times are both decreasing, they\nhave done so at roughly the same rate.\nThe relative speeds have remained the same for over several decades,\nin that the difference in access time between RAM and a\ndisk drive has remained in the range between a factor of 100,000 and\n1,000,000."}, "To gain some intuition for the significance of this speed difference,\nconsider the time that it might take for you to look up the entry for\ndisk drives in the index of this book, and then turn to the\nappropriate page.\nCall this your \"primary memory\" access time.\nIf it takes you about 20 seconds to perform this access, then\nan access taking 500,000 times longer would require\nmonths.", "It is interesting to note that while processing speeds have increased\ndramatically, and hardware prices have dropped dramatically, disk\nand memory access times have improved by less than an order of magnitude\nover the past 15 years.\nHowever, the situation is really much better than that modest speedup\nwould suggest.\nDuring the same time period, the size of both disk and\nmain memory has increased by over three orders of magnitude.\nThus, the access times have actually decreased in the face of a\nmassive increase in the density of these storage devices.", "Due to the relatively slow access time for data on disk as compared to\nmain memory, great care is required to create efficient applications\nthat process disk-based information.\nThe million-to-one ratio of disk access time versus main memory access\ntime makes the following rule of paramount importance when designing\ndisk-based applications:", {"strong": "Minimize the number of disk accesses!"}, {"title_reference": ["File structure", "caching"], "#text": "There are generally two approaches to minimizing disk accesses.\nThe first is to arrange information so that if you do access data from\nsecondary memory, you will get what you need in as few\naccesses as possible, and preferably on the first access.\n is the term used for a\ndata structure that organizes data stored in secondary memory.\nFile structures should be organized so as to minimize the required\nnumber of disk accesses.\nThe other way to minimize disk accesses is to save information\npreviously retrieved (or retrieve additional data with each access at\nlittle additional cost) that can be used to\nminimize the need for future accesses.\nThis requires the ability to guess accurately\nwhat information will be needed later and store it in primary memory\nnow.\nThis is referred to as ."}], "target": {"@refid": "price"}, "topic": {"@ids": "price", "@names": "price", "title": "Table", "paragraph": "Price comparison table for some writable electronic data storage\nmedia in common use.\nPrices are in US Dollars/MB.", "math_block": {"@xml:space": "preserve", "#text": "\\begin{array}{l|r|r|r|r|r|r|r}\n\\hline\n\\textbf{Medium}& 1996 & 1997 & 2000 & 2004 & 2006 & 2008 & 2011\\\\\n\\hline\n\\textbf{RAM}&    \\$45.00 & 7.00 & 1.500 & 0.3500 & 0.1500 & 0.0339 & 0.0138\\\\\n\\textbf{Disk}&      0.25 & 0.10 & 0.010 & 0.0010 & 0.0005 & 0.0001 & 0.0001\\\\\n\\textbf{USB drive}& -- & --   & --    & 0.1000 & 0.0900 & 0.0029 & 0.0018\\\\\n\\textbf{Floppy}&    0.50 & 0.36 & 0.250 & 0.2500 & -- & -- & --\\\\\n\\textbf{Tape}&      0.03 & 0.01 & 0.001 & 0.0003 & -- & -- & --\\\\\n\\textbf{Solid State}& -- & --   &  --   &  --    & -- & -- & 0.0021\\\\\n\\hline\n\\end{array}"}}}}