{
    "translations": {
      "en": {
        "sc1": "Consider a blockchain network where we have four nodes, 1-4. The network is a peer-to-peer network where all nodes have their own versions of the current blockchain. They then propose and propagate blocks to adjacent nodes that then accept a new head or resolve a conflict caused by the decentralization of the network.",
        "sc2": "Suppose that green node 1 proposes green block A to be added to the chain. This is propagated throughout the network starting with adjacent nodes.",
        "sc3": "However, red node 4 also proposes red block B soon after.",
        "sc4": "Due to the timing, a theoretical fork appears in the blockchain. Some nodes have accepted green block A as the head of the blockchain while others will have accepted red block B. The two existing versions of the blockchain are shown on the right. Note that they both append to the prir consensus of the chain.",
        "sc5": "Blue node 2 now proposes a block that continues the chain it has. This is where consensus begins. Since green block A was accepted as the ehad of blue node 2, the proposed block is in reference to green block A's hash pointer. When the block propagates, all nodes that have red block B as the head cannot accept the block. This equates to a disparity of work done on chains containing green block A and red block B.",
        "sc6": "As blocks are proposed, the disparity becomes increasingly significant. The network will agree that because an existing branch has had more work done in the form of subsequent blocks, it will be the accepted version and other branches will discard and update to the accepted branch.",
        "sc7": "Similar to the orange node, the non-red nodes have the best chance to benefit if they append to the main blockchain. This effectively pits a fork against the rest of the network and deincentivizes proposals on old blocks and forks that aren't the current main chain.",
        "sc8": "Since the green node's branch becomes longer, its sub-blockchain continues to be apart of the actual chain and the red branch is discarded."
      }
    }
  }
  
