{
  "translations" :{
    "en": {
      "Slide 1": "Let's see how we can differentiate between a problem, problem instance, algorithm, and a program.",
      "Slide 2": "A problem is a task that matches input to output.",
      "Slide 3": "<br><br> Consider the problem of searching for an element in an array.",
      "Slide 4": "Here, we have: <br><b><u> Input: </u></b> An array, and the target key.",
      "Slide 5": "<br><b><u> Output: </u></b> The index of the target element if it is found or the size of the array if not found.",
      "Slide 6": "<br><br>Note here that we have the searching problem as a black box. We don't know how the searching is performed.",
      "Slide 7": "A problem instance is a specific selection of values for the problem input.",
      "Slide 8": "<br><br> Here we see an example of a searching problem instance in which we have initialized the array and we have a value for the target key.",
      "Slide 9": "An algorithm is a receipe or a specific way of mapping problem input to output.",
      "Slide 10": "<br><br> An algorithm takes a problem instance as its input.",
      "Slide 11": "<br><br>Then a series of steps is performed to generate the output.",
      "Slide 12": "There are several different algorithms that can solve a particular problem. For the searching problem, here we present the sequencial search algorithm.",
      "Slide 13": "<br><br> The sequencial search algorithm simply loops through all the keys in the array until the target key is found in which the index is returned. Otherwise the array size is returned.",
      "Slide 14": "A program is an instance of a particular algorithm that solves a particular problem implemented in some programming language.",
      "Slide 15": "<br><br>A program accepts a problem instance as an input.",
      "Slide 16": "<br><br>Then the program is executed to generate the output.",
      "Slide 17": "Here we present the sequencial search algorithm implemented as a Java function."
    }
  },
  "code" : {
    "java": [{
      "url": "../../../SourceCode/Java/Searching/SequentialNoComments.java",
      "lineNumbers": false,
      "startAfter": "/* *** ODSATag: Sequential *** */",
      "endBefore": "/* *** ODSAendTag: Sequential *** */",
	  "top": 150,
	  "left": 385,
      "tags": {
        
      }
    },
    {
      "url": "../../../SourceCode/Pseudo/Searching/Sequential.txt",
      "lineNumbers": false,
      "startAfter": "/* *** ODSATag: Sequential *** */",
      "endBefore": "/* *** ODSAendTag: Sequential *** */",
	  "top": 150,
	  "left": 385,
      "tags": {
        
      }
    }]
  }
}
